xihua13104/bluekitchen/port/stm32-f4discovery-csr8x11-freertos/exception_handler/src/exception_handler.c
void exception_get_assert_expr(const char **expr, const char **file, int *line)
{
    if (assert_expr.is_valid) {
        *expr = assert_expr.expr;
        *file = assert_expr.file;
        *line = assert_expr.line;
    } else {
        *expr = NULL;
        *file = NULL;
        *line = 0;
    }
}

void exception_print_assert_info(void)
{
    if (assert_expr.is_valid == 1) {
        exception_printf("CM4 assert failed: %s, file: %s, line: %d\r\n",
                         assert_expr.expr,
                         assert_expr.file,
                         (int)assert_expr.line);
    } else if (assert_expr.is_valid == 2) {

    }
}

void exception_dump_config(int flag)
{
    reboot_flag = flag;
}

static int reboot_check(void)
{
    return reboot_flag;
}

void exception_reboot(void)
{
    NVIC_SystemReset();
}

/******************************************************************************/
/*            Exception's Dump Mode Functions                        */
/******************************************************************************/
int exception_dump_config_init(void)
{
    exception_dump_config(0);
    return 0;
}

exception_status_t exception_register_regions(memory_region_type *region)
{
    if (exception_user_regions.items >= EXCEPTION_CONFIGURATIONS_MAX) {
        return EXCEPTION_STATUS_ERROR;
    } else {
        exception_user_regions.regions[exception_user_regions.items].region_name = region->region_name;
        exception_user_regions.regions[exception_user_regions.items].start_address = region->start_address;
        exception_user_regions.regions[exception_user_regions.items].end_address = region->end_address;
        exception_user_regions.regions[exception_user_regions.items].is_dumped = region->is_dumped;
        exception_user_regions.items++;
        return EXCEPTION_STATUS_OK;
    }
}

/******************************************************************************/
/*            Exception's init Functions                                      */
/******************************************************************************/
void exception_init(void)
{
    /*enable unalign access,it will not trap when align access occurs */
    SCB->CCR &= ~SCB_CCR_UNALIGN_TRP_Msk;

    /* enable wdt reset mode for prevent exception flow hang */
    exception_enable_wdt_reset();

    /* show pc */
    exception_printf("cm4 pc:0x%x\r\n", exception_context.pc);
    /* show lr */
    exception_printf("cm4 lr:0x%x\r\n", exception_context.lr);

    exception_dump_config_init();
    /* Update Exception Number */
    exception_info.count += 1;
    /* Get current time stamp */
#ifdef BTSTACK_FREERTOS_ENABLE
    exception_info.timestamp =  xTaskGetTickCount();
#else
	exception_info.timestamp =  HAL_GetTick();
#endif
}

/******************************************************************************/
/*            Exception's context dump Functions                              */
/******************************************************************************/
static void exception_dump_context(uint32_t stack[])
{
    /* Context Dump */
    exception_context.sp   = ((uint32_t)stack) + 0x20;
    /* FPU context? */
    if ((exception_context.exc_return & 0x10) == 0) {
        exception_context.control |= 0x4; /* CONTROL.FPCA */
        exception_context.s0 = stack[s0];
        exception_context.s1 = stack[s1];
        exception_context.s2 = stack[s2];
        exception_context.s3 = stack[s3];
        exception_context.s4 = stack[s4];
        exception_context.s5 = stack[s5];
        exception_context.s6 = stack[s6];
        exception_context.s7 = stack[s7];
        exception_context.s8 = stack[s8];
        exception_context.s9 = stack[s9];
        exception_context.s10 = stack[s10];
        exception_context.s11 = stack[s11];
        exception_context.s12 = stack[s12];
        exception_context.s13 = stack[s13];
        exception_context.s14 = stack[s14];
        exception_context.s15 = stack[s15];
        exception_context.fpscr = stack[fpscr];
        exception_context.sp += 72; /* s0-s15, fpsr, reserved */
    }

    /* if CCR.STKALIGN=1, check PSR[9] to know if there is forced stack alignment */
    if ((SCB->CCR & SCB_CCR_STKALIGN_Msk) && (exception_context.psr & 0x200)) {
        exception_context.sp += 4;
    }

    /* update CONTROL.SPSEL and psp if returning to thread mode */
    if (exception_context.exc_return & 0x4) {
        exception_context.control |= 0x2; /* CONTROL.SPSel */
        exception_context.psp = exception_context.sp;
    } else { /* update msp if returning to handler mode */
        exception_context.msp = exception_context.sp;
    }

    /* feed wdt to keep time for context dump */
    exception_feed_wdt();

    exception_printf("\r\nCM4 Register dump begin:\r\n");
    exception_printf("r0  = 0x%08x\r\n", exception_context.r0);
    exception_printf("r1  = 0x%08x\r\n", exception_context.r1);
    exception_printf("r2  = 0x%08x\r\n", exception_context.r2);
    exception_printf("r3  = 0x%08x\r\n", exception_context.r3);
    exception_printf("r4  = 0x%08x\r\n", exception_context.r4);
    exception_printf("r5  = 0x%08x\r\n", exception_context.r5);
    exception_printf("r6  = 0x%08x\r\n", exception_context.r6);
    exception_printf("r7  = 0x%08x\r\n", exception_context.r7);
    exception_printf("r8  = 0x%08x\r\n", exception_context.r8);
    exception_printf("r9  = 0x%08x\r\n", exception_context.r9);
    exception_printf("r10 = 0x%08x\r\n", exception_context.r10);
    exception_printf("r11 = 0x%08x\r\n", exception_context.r11);
    exception_printf("r12 = 0x%08x\r\n", exception_context.r12);
    exception_printf("lr  = 0x%08x\r\n", exception_context.lr);
    if (exception_context.pc < 0x08000000)
        exception_printf("pc  = 0x%08x\r\n", exception_context.lr);
    else
        exception_printf("pc  = 0x%08x\r\n", exception_context.pc);
    exception_printf("xpsr = 0x%08x\r\n", exception_context.psr);
    exception_printf("EXC_RET = 0x%08x\r\n", exception_context.exc_return);

