xihua13104/bluekitchen/port/stm32-f4discovery-csr8x11-freertos/exception_handler/src/exception_handler.c
    /* FPU context? */
    if ((exception_context.exc_return & 0x10) == 0) {
        exception_printf("s0  = 0x%08x\r\n", exception_context.s0);
        exception_printf("s1  = 0x%08x\r\n", exception_context.s1);
        exception_printf("s2  = 0x%08x\r\n", exception_context.s2);
        exception_printf("s3  = 0x%08x\r\n", exception_context.s3);
        exception_printf("s4  = 0x%08x\r\n", exception_context.s4);
        exception_printf("s5  = 0x%08x\r\n", exception_context.s5);
        exception_printf("s6  = 0x%08x\r\n", exception_context.s6);
        exception_printf("s7  = 0x%08x\r\n", exception_context.s7);
        exception_printf("s8  = 0x%08x\r\n", exception_context.s8);
        exception_printf("s9  = 0x%08x\r\n", exception_context.s9);
        exception_printf("s10 = 0x%08x\r\n", exception_context.s10);
        exception_printf("s11 = 0x%08x\r\n", exception_context.s11);
        exception_printf("s12 = 0x%08x\r\n", exception_context.s12);
        exception_printf("s13 = 0x%08x\r\n", exception_context.s13);
        exception_printf("s14 = 0x%08x\r\n", exception_context.s14);
        exception_printf("s15 = 0x%08x\r\n", exception_context.s15);
        exception_printf("s16 = 0x%08x\r\n", exception_context.s16);
        exception_printf("s17 = 0x%08x\r\n", exception_context.s17);
        exception_printf("s18 = 0x%08x\r\n", exception_context.s18);
        exception_printf("s19 = 0x%08x\r\n", exception_context.s19);
        exception_printf("s20 = 0x%08x\r\n", exception_context.s20);
        exception_printf("s21 = 0x%08x\r\n", exception_context.s21);
        exception_printf("s22 = 0x%08x\r\n", exception_context.s22);
        exception_printf("s23 = 0x%08x\r\n", exception_context.s23);
        exception_printf("s24 = 0x%08x\r\n", exception_context.s24);
        exception_printf("s25 = 0x%08x\r\n", exception_context.s25);
        exception_printf("s26 = 0x%08x\r\n", exception_context.s26);
        exception_printf("s27 = 0x%08x\r\n", exception_context.s27);
        exception_printf("s28 = 0x%08x\r\n", exception_context.s28);
        exception_printf("s29 = 0x%08x\r\n", exception_context.s29);
        exception_printf("s30 = 0x%08x\r\n", exception_context.s30);
        exception_printf("s31 = 0x%08x\r\n", exception_context.s31);
        exception_printf("fpscr = 0x%08x\r\n", exception_context.fpscr);
    }

    exception_printf("CONTROL = 0x%08x\r\n", exception_context.control);
    exception_printf("MSP     = 0x%08x\r\n", exception_context.msp);
    exception_printf("PSP     = 0x%08x\r\n", exception_context.psp);
    exception_printf("sp      = 0x%08x\r\n", exception_context.sp);
    exception_printf("basepri = 0x%08x\r\n", exception_context.basepri);
    exception_printf("primask = 0x%08x\r\n", exception_context.primask);
    exception_printf("faultmask = 0x%08x\r\n", exception_context.faultmask);
    exception_printf("\r\nCM4 Register dump end:\r\n");
}

/******************************************************************************/
/*            Exception's memory dump Functions                               */
/******************************************************************************/
static void exception_dump_region_info(const memory_region_type *static_regions, exception_user_regions_t *user_regions)
{
    uint32_t i = 0;
    unsigned int *current, *end;

    /* static regions */
    for (i = 0; ; i++) {
        if (!static_regions[i].region_name) {
            break;
        }
        if (!static_regions[i].is_dumped) {
            continue;
        }
        current = (unsigned int *)((uint32_t)(static_regions[i].start_address) & 0xfffffffc);
        end     = (unsigned int *)(static_regions[i].end_address);
        if (current < end) {
            /* feed wdt to keep time for output data */
            exception_feed_wdt();
            /* output region's information */
            exception_printf("Region-%s: start_address = 0x%x, end_address = 0x%x\r\n", static_regions[i].region_name, (unsigned int)current, (unsigned int)end);
        }
    }

    /* dynamic regions */
    for (i = 0; ((i < user_regions->items) && (i < EXCEPTION_CONFIGURATIONS_MAX)); i++) {
        if ((user_regions->regions)[i].is_dumped) {
            current = (unsigned int *)((uint32_t)((user_regions->regions)[i].start_address) & 0xfffffffc);
            end     = (unsigned int *)((user_regions->regions)[i].end_address);
            if (current < end) {
                /* feed wdt to keep time for output data */
                exception_feed_wdt();
                /* output region's information */
                exception_printf("Region-%s: start_address = 0x%x, end_address = 0x%x\r\n", (user_regions->regions)[i].region_name, (unsigned int)current, (unsigned int)end);
            }
        }
    }
}

static void exception_dump_region_data_text(const memory_region_type *static_regions, exception_user_regions_t *user_regions)
{
    uint32_t i = 0;
    unsigned int *current, *end;

    /* static regions */
    for (i = 0; ; i++) {
        if (!static_regions[i].region_name) {
            break;
        }
        if (!static_regions[i].is_dumped) {
            continue;
        }
        current = (unsigned int *)((uint32_t)(static_regions[i].start_address) & 0xfffffffc);
        end     = (unsigned int *)(static_regions[i].end_address);
        for (; current < end; current += 4) {
            if (*(current + 0) == 0 &&
                    *(current + 1) == 0 &&
                    *(current + 2) == 0 &&
                    *(current + 3) == 0) {
                continue;
            }
            /* feed wdt to keep time for output data */
            exception_feed_wdt();
            /* output data */
            exception_printf("0x%08x: %08x %08x %08x %08x\r\n",
                             (unsigned int)current,
                             *(current + 0),
                             *(current + 1),
                             *(current + 2),
                             *(current + 3));
        }
    }

    /* dynamic regions */
    for (i = 0; ((i < user_regions->items) && (i < EXCEPTION_CONFIGURATIONS_MAX)); i++) {
        if ((user_regions->regions)[i].is_dumped) {
            current = (unsigned int *)((uint32_t)((user_regions->regions)[i].start_address) & 0xfffffffc);
            end     = (unsigned int *)((user_regions->regions)[i].end_address);
            for (; current < end; current += 4) {
                if (*(current + 0) == 0 &&
                        *(current + 1) == 0 &&
                        *(current + 2) == 0 &&
                        *(current + 3) == 0) {
                    continue;
                }
                /* feed wdt to keep time for output data */
                exception_feed_wdt();
                /* output data */
                exception_printf("0x%08x: %08x %08x %08x %08x\r\n",
                                 (unsigned int)current,
                                 *(current + 0),
                                 *(current + 1),
                                 *(current + 2),
                                 *(current + 3));
            }
        }
    }
}

static void exception_dump_memory(void)
{
    /* feed wdt to keep time for memory dump */
    exception_feed_wdt();
    /* Print Regions' information */
    exception_printf("CM4 Regions Information:\r\n");
    exception_dump_region_info(memory_regions, &exception_user_regions);
    /* Print Regions' data */
    exception_dump_region_data_text(memory_regions, &exception_user_regions);
    /* dump cm4 end log */
    exception_printf("\r\nmemory dump completed.\r\n");
}

/******************************************************************************/
/*            Exception's print fault type Functions                          */
/******************************************************************************/
static void printUsageErrorMsg(uint32_t CFSRValue)
{
    exception_printf("Usage fault: ");
    CFSRValue >>= 16; /* right shift to lsb */
    if ((CFSRValue & (1 << 9)) != 0) {
        exception_printf("Divide by zero\r\n");
    }
    if ((CFSRValue & (1 << 8)) != 0) {
        exception_printf("Unaligned access\r\n");
    }
    if ((CFSRValue & (1 << 3)) != 0) {
        exception_printf("Coprocessor error\r\n");
    }
    if ((CFSRValue & (1 << 2)) != 0) {
        exception_printf("Invalid EXC_RETURN\r\n");
    }
    if ((CFSRValue & (1 << 1)) != 0) {
        exception_printf("Invalid state\r\n");
    }
    if ((CFSRValue & (1 << 0)) != 0) {
        exception_printf("Undefined instruction\r\n");
    }
}

static void printMemoryManagementErrorMsg(uint32_t CFSRValue)
{
    exception_printf("Memory Management fault: ");
    CFSRValue &= 0x000000FF; /* mask mem faults */
    if ((CFSRValue & (1 << 5)) != 0) {
        exception_printf("A MemManage fault occurred during FP lazy state preservation\r\n");
    }
    if ((CFSRValue & (1 << 4)) != 0) {
        exception_printf("A derived MemManage fault occurred on exception entry\r\n");
    }
    if ((CFSRValue & (1 << 3)) != 0) {
        exception_printf("A derived MemManage fault occurred on exception return\r\n");
    }
    if ((CFSRValue & (1 << 1)) != 0) { /* Need to check valid bit (bit 7 of CFSR)? */
        exception_printf("Data access violation @0x%08x\r\n", (unsigned int)SCB->MMFAR);
    }
    if ((CFSRValue & (1 << 0)) != 0) {
        exception_printf("MPU or Execute Never (XN) default memory map access violation\r\n");
    }
    if ((CFSRValue & (1 << 7)) != 0) { /* To review: remove this if redundant */
        exception_printf("SCB->MMFAR = 0x%08x\r\n", (unsigned int)SCB->MMFAR);
    }
}

