xihua13104/bluekitchen/port/stm32-f4discovery-csr8x11-freertos/exception_handler/src/exception_handler.c
static void printBusFaultErrorMsg(uint32_t CFSRValue)
{
    exception_printf("Bus fault: ");
    CFSRValue &= 0x0000FF00; /* mask bus faults */
    CFSRValue >>= 8;
    if ((CFSRValue & (1 << 5)) != 0) {
        exception_printf("A bus fault occurred during FP lazy state preservation\r\n");
    }
    if ((CFSRValue & (1 << 4)) != 0) {
        exception_printf("A derived bus fault has occurred on exception entry\r\n");
    }
    if ((CFSRValue & (1 << 3)) != 0) {
        exception_printf("A derived bus fault has occurred on exception return\r\n");
    }
    if ((CFSRValue & (1 << 2)) != 0) {
        exception_printf("Imprecise data access error has occurred\r\n");
    }
    if ((CFSRValue & (1 << 1)) != 0) { /* Need to check valid bit (bit 7 of CFSR)? */
        exception_printf("A precise data access error has occurred @x%08x\r\n", (unsigned int)SCB->BFAR);
    }
    if ((CFSRValue & (1 << 0)) != 0) {
        exception_printf("A bus fault on an instruction prefetch has occurred\r\n");
    }
    if ((CFSRValue & (1 << 7)) != 0) { /* To review: remove this if redundant */
        exception_printf("SCB->BFAR = 0x%08x\r\n", (unsigned int)SCB->BFAR);
    }
}
/******************************************************************************/
/*            Exception's dump processor Functions                            */
/******************************************************************************/
void exception_dump_preprocess(uint32_t fault_type)
{
    exception_info.reason = fault_type;
    exception_info.assert_expr = &assert_expr;
    /* Genie start message */
    exception_printf("<<<<<<<< LOG START LOG START LOG START LOG START LOG START <<<<<<<<\r\n");
    /* feed wdt to keep time for preprocess */
    exception_feed_wdt();
    exception_printf("\r\nCM4 Fault Dump:\r\n");
    exception_print_assert_info();
    exception_printf("Exception Count = 0x%08x\r\n", (unsigned int)exception_info.count);
    exception_printf("Exception Time = 0x%08x\r\n", (unsigned int)exception_info.timestamp);
    switch (exception_info.reason) {
        case EXCEPTION_NMI:
            exception_printf("\r\nIn NMI Fault Handler\r\n");
            break;
        case EXCEPTION_HARD_FAULT:
            exception_printf("\r\nIn Hard Fault Handler\r\n");
            break;
        case EXCEPTION_MEMMANAGE_FAULT:
            exception_printf("\r\nIn MemManage Fault Handler\r\n");
            break;
        case EXCEPTION_BUS_FAULT:
            exception_printf("\r\nIn Bus Fault Handler\r\n");
            break;
        case EXCEPTION_USAGE_FAULT:
            exception_printf("\r\nIn Usage Fault Handler\r\n");
            break;
        case EXCEPTION_DEBUGMON_FAULT:
            exception_printf("\r\nIn Debug Monitor Fault Handler\r\n");
            break;
        default:
            exception_printf("\r\nIn Unknow Fault Handler\r\n");
            break;
    }
    exception_printf("SCB->HFSR = 0x%08x\r\n", (unsigned int)SCB->HFSR);
    exception_printf("SCB->CFSR = 0x%08x\r\n", (unsigned int)SCB->CFSR);
    if ((SCB->HFSR & (1 << 30)) != 0) {
        exception_printf("Forced Hard Fault\r\n");
    }
    if ((SCB->CFSR & 0xFFFF0000) != 0) {
        printUsageErrorMsg(SCB->CFSR);
    }
    if ((SCB->CFSR & 0x0000FF00) != 0) {
        printBusFaultErrorMsg(SCB->CFSR);
    }
    if ((SCB->CFSR & 0x000000FF) != 0) {
        printMemoryManagementErrorMsg(SCB->CFSR);
    }
}

void exception_dump_postprocess(void)
{
    uint32_t i = 0;
    for (i = 0; i < exception_config.items; i++) {
        if (exception_config.configs[i].init_cb) {
            /* feed wdt to keep time for init callback */
            exception_feed_wdt();
            /* run init callback */
            exception_config.configs[i].init_cb();
        }
    }
    /* Genie complete message */
    exception_printf("<<<<<<<< LOG END LOG END LOG END LOG END LOG END <<<<<<<<\r\n");
}

/******************************************************************************/
/*            Cortex-M4 Processor Exceptions Handlers                         */
/******************************************************************************/
void exception_cm4_fault_handler(uint32_t stack[], uint32_t fault_type)
{
    /* dump exception time, fault type, etc */
    exception_dump_preprocess(fault_type);
    /* dump the context when the exception happens */
    exception_dump_context(stack);
    /* dump the memory */
    exception_dump_memory();
    /* finish the dump */
    exception_dump_postprocess();
    /* check if reboot */
    if (reboot_check()) {
        exception_reboot();
    } else {
        /* disable wdt reset mode for entering while loop */
        /* maybe wdt has been changed to interrupt mode for triggering the NMI interrupt */
        exception_disable_wdt_reset();
        while (1);
    }
}

